Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ། བདག་ཅག་ནི་བཀྲེས་ཀྱིས་འགྲངས་པར་མཛོད་ཅིག །
en: ‘O great compassionate one, we are famished! Please feed us.’

source: རྒྱལ་པོས་སྨྲས་པ། ངས་ཁྱེད་ཁ་ཟས་ཇི་ལྟ་བུ་ཞིག་གིས་འགྲངས་པར་བྱ།
en: “ ‘With what manner of food shall I feed you?’ asked the king.

source: དེ་དག་གིས་སྨྲས་པ། ཁྲག་འཕྲལ་དུ་ཕྱུང་བས་འགྲངས་པར་མཛོད་ཅིག །
en: “ ‘Please feed us with freshly drawn blood,’ they said.

source: དེ་ནས་རྒྱལ་པོས་བསམས་པ། མ་ལ་ཆ་ལུགས་འདི་འདྲ་བ་ལ་ཁ་ཟས་དེ་འདྲ་བ་ལས་ན།
en: “At that the king thought, ‘Oh my! Though they dress one way, their food is another thing entirely!

source: འདི་དག་ནི་མི་ཡིན་པ་མི་འདྲ་སྟེ།
en: They’re not like human beings.

source: འདི་དག་ནི་མི་མ་ཡིན་པ་དག་ཅིག་ཡིན་གོར་མ་ཆག་གིས་འདི་དག་ལ་ཇི་ལྟར་དམ་བཅས་པ་བཞིན་དུ་བྱ་དགོས་སོ། །
en: But even if they’re not human, I shall do for them as I have promised.

source: གཞན་དག་གི་ལུས་ལ་གནོད་པ་མ་བྱས་ཀྱི་བར་དུ་ནི་ངས་འདི་རྣམས་ཀྱི་ཁ་ཟས་ཀྱི་དོན་བསྒྲུབ་པར་མི་ནུས་ལ།
en: Still, I can’t harm others for the sake of feeding them,

source: གཞན་ལ་གནོད་པ་མ་བྱས་ཀྱི་བར་དུ་ཡང་ཁྲག་འཕྲལ་དུ་ཕྱུང་བ་རྙེད་པར་མི་ནུས་ཏེ
en: yet without harming others I cannot get freshly drawn blood.

source: གལ་ཏེ་འདི་དག་བདག་གི་ཁྲག་གིས་ཁ་ཟས་ཀྱི་དོན་བྱེད་ནུས་ན་ནི་བདག་གིས་འདི་རྣམས་ལ་བདག་གི་ཤ་དང་ཁྲག་སྦྱིན་ནོ་སྙམ་ནས།
en: If they can use my blood for food, then I will give them my own flesh and blood.’

source: གནོད་སྦྱིན་དེ་དག་ལ་སྨྲས་པ།
en: So he asked the yakṣas,

source: གྲོགས་པོ་དག་ངའི་ཁྲག་གིས་ཁ་ཟས་ཀྱི་དོན་བྱེད་ནུས་སམ།
en: ‘My friends, could you perhaps use my blood for food?’

source: གནོད་སྦྱིན་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་རྔོ་ཐོགས་ལགས་སོ། །
en: “ ‘Yes, Deva, we could!’ they replied.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་བྱམས་པའི་སྟོབས་ཀྱིས། གནོད་སྦྱིན་དེ་དག་མདུན་དུ་བཀད་དུ་བཅུག་ནས་སྨན་པ་རྣམས་བོས་ཏེ་བཀའ་སྩལ་པ།
en: “When he heard this, without delay King Maitrībala arrayed the yakṣas before him and then summoned his healers and made his request, saying,

source: ཀྭའི་ངའི་ལུས་ལ་གཏར་ཀ་ལྔ་ཐོབ་ཤིག་དང་སེམས་ཅན་འདི་དག་ལ་ཁྲག་གིས་འགྲངས་པར་བྱའོ། །
en: ‘Find five points on my body from which to drain me, and I shall feed these beings with my blood.’

source: སྨན་པ་རྣམས་ཀྱིས་གསོལ་པ། བདག་ཅག་གིས་ལྷའི་སྐུ་ལ་མཚོན་གྱིས་གདབ་པའི་རྔོ་མི་ཐོགས་ལགས་སོ། །
en: “ ‘But Deva,’ the healers pleaded, ‘we could never pierce your body with a weapon!’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བསམས་པ། འདི་དག་ནི་བདག་དང་འབྲལ་བ་མཐོང་མི་འདོད་ཀྱིས་མ་ལ་བདག་གིས་བདག་གི་ཁྲག་དབྱུང་ངོ་སྙམ་སྟེ
en: “ ‘They do not wish to be parted from me,’ he thought. ‘Very well, I will extract my own blood.’

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཅི་ལ་ཡང་བྱང་བ་ཡིན་ཏེ། དེས་བདག་ཉིད་ཀྱིས་མེ་ལོང་བླངས་ནས། རང་གི་ལུས་ལ་གཏར་ཁ་ལྔ་བཏབ་སྟེ།
en: Bodhisattvas have mastery of all manner of arts and professions, so he took up a mirror himself, pierced five points on his body,

source: གནོད་སྦྱིན་རེ་རེ་ལ་བསྟབས་ནས་ངས་འདི་དག་འགྲངས་པར་མ་གྱུར་གྱི་བར་དུ་གཏར་ཀ་འདི་དག་གཅད་པར་མི་བྱའོ་ཞེས་དམ་བཅས་སོ། །
en: and offered one to each of the yakṣas, thinking, ‘I shall not stop letting my own blood until they are satisfied.’

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ལ།
en: ‘Bodhisattvas keep their promises,

source: བྱང་ཆུབ་སེམས་དཔའ་འདིས་ཀྱང་མཆོག་ཏུ་དཀའ་བ་ཞིག་བརྩམས་ཀྱིས།
en: and this bodhisattva has undertaken a magnificent austerity.

source: བྱང་ཆུབ་སེམས་དཔའ་ཧ་ཅང་ཡུན་རིང་དུ་འོ་བརྒྱལ་ན་མི་རུང་ངོ་སྙམ་ནས
en: It wouldn’t be right for the bodhisattva to suffer too much hardship.’

source: མ་ལ་བདག་གིས་འདིའི་ལུས་ཐམས་ཅད་དུ་གཟི་བྱིན་བསྣན་པར་བྱའོ་སྙམ་སྟེ།
en: He decided, ‘I will fortify the life in his body!’

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཐམས་ཅད་དུ་ལྷའི་གཟི་བྱིན་བསྣན་ནས།
en: “So Śakra, King of the Gods, fortified the bodhisattva’s body with divine life force,

source: གཏར་ཀ་དེ་དག་ཀྱང་ཆེ་རབ་ཏུ་སྤྲུལ་ཏོ། །
en: and even miraculously accomplished much of the bloodletting.

source: བྱང་ཆུབ་སེམས་དཔས་ཀྱང་གཟི་བྱིན་འཕྲོག་པའི་གནོད་སྦྱིན་ལྔ་པོ་དེ་དག་དཀའ་བ་མེད་པར་ཚིམ་པར་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ།
en: After the bodhisattva had sated all five of the life-draining yakṣas with no difficulty at all, he prayed for unexcelled, total, and complete enlightenment, saying,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་ཅིང་ཡོངས་སུ་འདྲེན་པ་མེད་པར་སེམས་ཅན་མ་རྒལ་བ་རྣམས་སྒྲོལ་བ་དང་། མ་གྲོལ་བ་རྣམས་དགྲོལ་བ་དང་། དབུགས་མ་ཕྱིན་པ་རྣམས་དབུགས་འབྱིན་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བའི་སངས་རྒྱས་སུ་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་སྟེ
en: ‘By this root of virtue, may I become a buddha to serve as a protector for the world’s blind without a guide, without any guide at all, without anyone to show them the way, to rescue those who have not found their way across, to deliver those who have not been delivered, to relieve the anxiety of those frozen with fear, and to place in nirvāṇa all those who have not transcended suffering.

source: སྦྱིན་པ་ཆེན་པོར་གྱུར་པ་འདི་ཡིས་ནི། །འགྲོ་བར་རང་བྱུང་སངས་རྒྱས་གྱུར་པར་ཤོག །
en: “ ‘By this great gift may I become For wandering beings a self-arisen enlightened one.

source: སྔོན་གྱི་རྒྱལ་དབང་རྣམས་ཀྱིས་མ་བསྒྲལ་གང་། །སྐྱེ་བོ་སྲིད་པའི་ཆུ་ལས་སྒྲོལ་བར་ཤོག །
en: May I pull from the waters of this life those who were Not freed by the mighty victors who came before me.’

source: དེ་ནས་གནོད་སྦྱིན་དེ་དག་གང་གི་ཚེ་འགྲངས་ཤིང་ངོམས་པར་གྱུར་ཏེ། དབང་པོ་རྣམས་ཚིམ་པར་གྱུར་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: “After the yakṣas had had their fill and were sated, their senses contented, they asked the bodhisattva,

source: སྙིང་རྗེ་ཆེན་པོ་ཁྱོད་རྩོལ་བ་འདིས་ཅི་ཞིག་སྒྲུབ།
en: ‘Great compassionate one, what do you hope to accomplish by these efforts?’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་བོ། །
en: “ ‘I will attain unexcelled, total, and complete enlightenment,’ the bodhisattva replied.

source: དེ་དག་གིས་སྨྲས་པ། འོ་ན་གང་གི་ཚེ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། འགྲོ་བ་རྣམས་བདུད་རྩིས་ཚིམ་པར་མཛད་པ་དེའི་ཚེ། བདག་ཅག་ཁྱོད་ཀྱི་ཉན་ཐོས་ཀྱི་དང་པོར་གྱུར་ཅིག །
en: “ ‘If that’s so,’ they said, ‘when you awaken and manifest the unexcelled, total, and complete enlightenment of a buddha, satiating living beings with nectar, then may we become your very first disciples.’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཁྱེད་རྣམས་ནི་སྲོག་གཅོད་པ་ཕ་རོལ་གྱི་སྲོག་འཕྲོག་པ་ཡིན་ན། ཇི་ལྟར་ངས་དེ་འདྲ་བ་དག་ཉན་ཐོས་ཀྱི་དང་པོར་བྱ།
en: “ ‘How can I make you into my very first disciples,’ the bodhisattva asked, ‘when you are cutting short others’ lives, draining others’ life force?’

source: དེ་དག་གིས་སྨྲས་པ། སྙིང་རྗེ་ཆེན་པོ་བདག་ཅག་ལ་བཀའ་ཅི་སྩལ།
en: “ ‘Great compassionate one, what advice can you give us?’ they asked.

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ་གནས་པར་གྱིས་ཤིག །
en: “ ‘Adopt and maintain the path of the ten virtuous actions,’ said the bodhisattva.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་གནོད་སྦྱིན་དེ་རྣམས་ཀྱིས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ནས་སྨོན་ལམ་བཏབ་པ།
en: “The yakṣas heeded him, immediately adopting the path of the ten virtuous actions and praying,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་གང་གི་ཚེ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེའི་ཚེ། བདག་ཅག་འདིའི་ཉན་ཐོས་ཀྱི་དང་པོར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: ‘By this root of virtue, when this one awakens into unexcelled, total, and complete enlightenment, may we become his very first disciples.’

source: དེའི་ཚེ་རྒྱལ་པོ་བྱམས་པའི་སྟོབས་སུ་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I am the one who was King Maitrībala then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་གཟི་བྱིན་འཕྲོག་པའི་གནོད་སྦྱིན་ལྔ་པོ་གང་ཡིན་པ་དེ་དག་ནི་དགེ་སློང་ལྔ་སྡེ་འདི་དག་ཉིད་ཡིན་ཏེ།
en: Those who were the five yakṣas draining the life of others are none other than the group of five monks.

source: དེའི་ཚེ་ཡང་འདི་དག་ངས་རང་གི་ཤ་དང་ཁྲག་གིས་ཚིམ་པར་བྱས་ཏེ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་དོ། །
en: At that time, I fed them with my own flesh and blood and set them on the path of the ten virtuous actions.

source: ད་ལྟར་ཡང་ངས་འདི་རྣམས་དམ་པའི་ཆོས་ཀྱི་བཅུད་ཀྱིས་ཚིམ་པར་བྱས་ནས། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་དོ།། །།
en: Now as well I have sated them with a taste of the holy Dharma and established them in the unsurpassed, supreme welfare of nirvāṇa.”

source: རླུང་ནག་པོ་ཞེས་བྱ་བ་ནི།
en: The Dark Storm

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཚོང་པ་ལྔ་བརྒྱ་ཙམ་གྱིས་ཟོང་ཁྱེར་ཏེ། ཡུལ་གཞན་དུ་ཆས་ནས་
en: When the Blessed One was in Śrāvastī, five hundred merchants in Śrāvastī took up their goods and set out for another country.

source: དེ་དག་མཐར་གྱིས་སོང་སོང་བ་ལས་ནགས་ཁུང་ཆེན་པོ་དགོན་པ་ཞིག་ཏུ་ཕྱིན་ཏོ། །
en: They traveled and traveled until eventually they came to a great, dark forest.

source: ནགས་ཁུང་དེ་ན་གཟི་བྱིན་འཕྲོག་པའི་གནོད་སྦྱིན་དྲག་པོ་འཇིགས་པ། གཞན་གྱི་སྲོག་འཕྲོག་པ་ཞིག་ཀྱང་གནས་ཏེ།
en: In that forest lived a fierce, terrifying yakṣa who drained the life of others.

source: དེས་རླུང་ནག་པོ་ཆེན་པོ་བཏང་ནས་ཚོང་པ་དེ་དག་གི་སྟེང་དུ་བརྒྱུགས་ཏེ།
en: He sent forth a great, dark storm that overtook the merchants.

source: དེ་ནས་ཚོང་པ་དེ་དག་ཅི་བྱ་གཏོལ་མེད་པར་གྱུར་ནས། དེ་དག་འཇིགས་ཤིང་སྐྲག་སྟེ་ལྷའོ་ཅོག་ལ་གསོལ་བ་འདེབས་པ་ལ་ཞུགས་སོ། །
en: The merchants became desperate and had no idea what they should do. Terrified, they began making supplications to every possible deity.

source: དགེ་བསྙེན་ཞིག་ཀྱང་འདྲོན་པོ་དེ་དག་གི་ནང་ན་འདུག་སྟེ། དེས་ཚོང་པ་དེ་དག་ཅི་བྱ་གཏོལ་མེད་པར་འདུག་པ་མཐོང་ནས་སྨྲས་པ།
en: One of the leaders among them was a lay vow holder, and when he saw that the merchants had no idea what to do, he said,

source: ཀྱེ་སྐྱབས་མ་ཡིན་པ་འདི་རྣམས་ལ་སྐྱབས་བཙལ་ཏེ་ཅི་རུང་།
en: “What is the use of seeking refuge in these deities who are not a refuge?

source: བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་དེང་ཤིག་དང་དེས་ཁྱེད་དཀོས་ཐག་ཅིང་ཉམ་ང་ལ་ཕོངས་པར་གྱུར་པ་ལས་ཡོངས་སུ་བསྐྱབ་པར་འགྱུར་རོ། །
en: Take refuge in the Blessed One. He will protect you from suffering, despair, and misfortune.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཚོང་པ་དེ་དག་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་དོང་སྟེ།
en: No sooner had the merchants heard this than they took refuge in the Blessed One, saying,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ལ་ཕྱག་འཚལ་ལོ། །
en: “We bow to the Blessed One, the tathāgata, the arhat, the totally and completely awakened buddha.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ནི་འདི་ལྟ་སྟེ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་ཅི་ཡང་མི་གཟིགས་པ་དང་མི་མཁྱེན་པ་དང་ཐུགས་སུ་མི་ཆུད་པ་མི་མངའ་ན།
en: Lord, Blessed One, if there is nothing past, present, or future that you do not see, know, or directly perceive, then heed us now, Blessed One.

source: ཀྱེ་མ་བཅོམ་ལྡན་འདས་བདག་ཅག་དཀོས་ཐག་ཅིང་ཉམ་ང་ལ་ཕོངས་པར་གྱུར་པ་ལས། ཡོངས་སུ་བསྐྱབ་པ་དང་སྲོག་ཕངས་པ་སྩལ་དུ་གསོལ་ཞེས་བྱས་སོ། །
en: Protect us from suffering, despair, and misfortune, and save our precious lives!”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ་ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས། ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་རྒུད་སུ་ནི་དར་སུ་ནི་ཕོངས་ཤིང་འདུག་སུ་ནི་ཉམ་ང་བར་གྱུར། སུ་ནི་གནོད་པ་དང་ལྡན་སུ་ནི་ཕོངས་པ་དང་ཉམ་ང་བ་དང་གནོད་པ་དང་ལྡན་སུ་ནི་ངན་སོང་དུ་གཞོལ་སུ་ནི་ངན་སོང་དུ་འབབ་སུ་ནི་ངན་སོང་དུ་བབ་སུ་ནི་ངན་སོང་ནས་ཕྱུང་སྟེམཐོ་རིས་དང་ཐར་པ་དང་འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: “Who is in decline? Who will flourish? Who is destitute? Who is in a dreadful state? Who is being harmed? Who is destitute, in a dreadful state, and being harmed? Who is veering toward the lower realms? Who is descending through the lower realms? Who has descended to the lower realms? Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་ནས། ཚོང་པ་ལྔ་བརྒྱ་པོ་རྣམས་འདུལ་བའི་དུས་ལ་བབ་པར་ཐུགས་སུ་ཆུད་ནས།
en: When the Blessed One focused his mind, he directly apprehended that the time had come to tame the five hundred merchants.

source: ཕྱག་གླང་པོ་ཆེའི་སྣ་ལྟ་བུ་བརྐྱང་སྟེ། ཚོང་པ་ལྔ་བརྒྱ་པོ་དེ་དག་ནགས་ཁུང་དགོན་པ་དེ་ནས་བྲུངས་རྫས་དང་བཅས་ཏེ་བླངས་ནས། མཉན་དུ་ཡོད་པ་ནས་ཧ་ཅང་མི་རིང་བ་ཞིག་ཏུ་བཏོན་ཏེ་བཀོད་དོ། །
en: He stretched out his arm like an elephant’s trunk and lifted up all five hundred merchants and their packs out of the dark forest and set them down not too far from Śrāvastī.

source: དེ་ནས་ཚོང་པ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་མཉན་དུ་ཡོད་པར་ཕྱིན་པའི་རྟགས་རྣམས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་དག་གིས་བསམས་པ།
en: The five hundred merchants recognized that they were near Śrāvastī and thought,

source: བདག་ཅག་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱབས་མཛད་དོ་སྙམ་ནས་ཚོང་པ་དེ་དག་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ། དེ་དགའ་བར་གྱུར་ནས་བསམས་པ།
en: “The Blessed One has rescued us!” They were elated, and because of this they thought,

source: བདག་ཅག་ཁྱིམ་ན་གནས་པ་བཏང་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ་
en: “Let us give up living at home to go forth in the doctrine of the Blessed One,

source: ཆུ་བོ་རྣམས་ལས་བརྒལ་བར་བྱ་བ་དང་སྦྱོར་བ་རྣམས་ལས་ཡང་དག་པར་འདའ་བར་བྱ་བའི་ཕྱིར་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པར་བྱའོ་སྙམ་ནས་
en: in order to ford the floodwaters and completely escape our fetters with diligence, practice, and effort.”

source: མཉན་དུ་ཡོད་པར་དོང་སྟེརང་རང་གི་ཁྱིམ་གྱི་འཁོར་བཏང་ནས་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ཏེ།
en: So they went to Śrāvastī, gave up household affairs, and gave gifts and made merit.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་དོང་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཞབས་ལ་མཆུས་གཏུགས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: They entered the garden of Prince Jeta, where they went to see the Blessed One, touched their heads to the Blessed One’s feet, pressed their lips to his feet, and said to him,

source: བཅོམ་ལྡན་འདས་ནི་བདག་ཅག་ལ་དཀའ་བ་མཛད་པ་དང་།
en: “Blessed One, what a difficult task you have done for us!

source: སྲོག་ཕངས་པ་སྩོལ་བ་ལགས་སོ་ཞེས་གསོལ་ནས།
en: You saved our precious lives.”

source: ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: Then they sat before the Blessed One to listen to the Dharma.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་དག་གི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their thoughts, habitual tendencies, temperaments, capacities, and natures, and taught them the Dharma accordingly.

source: དེས་ན་ཚོང་པ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱས་ཏེ་
en: Hearing it, all five hundred merchants destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Having seen the truths, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and requested of the Blessed One,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་བྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་དག་ལ་ལུང་ཡང་ཕོག་གོ། །
en: With the words “Come, join me, monks!” the Blessed One led them to go forth as novices, conferred on them full ordination, and instructed them.

source: དེ་དག་གིས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་དག་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས། གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: As arhats, free from the attachments of the three realms, their minds regarded gold no differently than filth, and the palms of their hands as like space itself.

source: སྲིད་པའི་རྙེད་པ་དང་། ཆགས་པ་དང་། བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ།
en: They had no regard for worldly profit, passion, or acclaim.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: The monks inquired of the Blessed Buddha,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚོང་པ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་འཇིགས་པ་ཆེན་པོ་ལས་ཡོངས་སུ་བསྐྱབས་ཏེ། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་ལ་གཟིགས་ལགས།
en: “Lord, tell us why the Blessed One protected all five hundred merchants, rescued them from great danger, and established them in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ།
en: “Not only now,” the Blessed One explained,

source: འདས་པའི་དུས་ན་ཡང་ཚོང་པ་ལྔ་བརྒྱ་པོ་འདི་དག་ཉིད་ངས་ཇི་ལྟར་འཇིགས་པ་ཆེན་པོ་ལས་ཡོངས་སུ་བསྐྱབས་ནས། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “but in times past as well, and in the same way, I rescued these five hundred merchants from great danger and placed them in the four meditative states and the five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་ཚོང་པ་ལྔ་བརྒྱ་ཙམ་ཞིག་གིས་ཟོང་ཁྱེར་ཏེ། ཡུལ་གཞན་དུ་ཆས་ནས་
en: “Monks, in times gone by, some five hundred merchants took up their goods and set out for another country.

source: ནགས་ཁུང་དེ་ན་གཟི་བྱིན་འཕྲོག་པའི་གནོད་སྦྱིན་དྲག་པོ་འཇིགས་པ་གཞན་གྱི་སྲོག་འཕྲོག་པ་ཞིག་ཀྱང་གནས་ཏེ།
en: In that forest lived a fierce, terrifying yakṣa who drained the life of others.

source: དེས་ན་ཚོང་པ་དེ་དག་ཅི་བྱ་གཏོལ་མེད་པར་གྱུར་ནས་དེ་དག་འཇིགས་ཤིང་སྐྲག་པར་གྱུར་ཏོ། །
en: The merchants became desperate and had no idea what they should do. Terrified, they began making supplications to every possible deity.

source: དེའི་ཚེ་དྲང་སྲོང་གི་གནས་ཤིག་ན་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ།
en: “At that time there lived a certain sage who had all the five superknowledges,

source: རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཞིག་གནས་པ་དེས།
en: a person of great miracles and great power,

source: ཚོང་པ་ལྔ་བརྒྱ་སྡུག་བསྔལ་བར་གྱུར་པ་མཐོང་ངོ་། །
en: and he saw the suffering of the five hundred merchants.

source: མཐོང་ནས་ཀྱང་ཚོང་པ་ལྔ་བརྒྱ་པོ་དེ་དག་བྲུངས་རྫས་དང་བཅས་ཏེ། ནགས་ཁུང་དགོན་པ་དེ་ནས་བླངས་ནས་བདག་ཉིད་ཀྱི་གནས་སུ་བཀོད་དོ། །
en: As soon as he did, he lifted all five hundred merchants and their packs up out of the dark forest and set them back down whence they came.

source: དེ་ནས་ཚོང་པ་རྣམས་ཀྱིས་བསམས་པ།
en: The merchants thought,

source: ཅི་ཡང་རུང་སྟེ་བདག་ཅག་འཚོ་བར་གྱུར་པ་འདི་དག་ཐམས་ཅད་ནི་དྲང་སྲོང་འདིའི་མཐུ་ཡིན་གྱིས།
en: ‘Regardless of how it happened, it is all because of this sage that we are still alive.

source: བདག་ཅག་གིས་ཁྱིམ་ན་གནས་པ་བཏང་ལ་འདི་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་སྟེ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ་སྙམ་ནས
en: In his presence let us give up living at home, and go forth to practice pure conduct.’

source: ཚོང་པ་ལྔ་བརྒྱ་པོ་དེ་དག་དྲང་སྲོང་དེ་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་ནས། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: So in his presence they went forth, and all five hundred merchants generated the four meditative states and the five superknowledges.

source: དེའི་ཚེ་དྲང་སྲོང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I am the one who was that sage then.

source: དེའི་ཚེ་ཚོང་པ་ལྔ་བརྒྱར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་ཚོང་པ་ལྔ་བརྒྱ་པོ་འདི་དག་ཡིན་ཏེ།
en: Those who were the five hundred merchants then are none other than these five hundred merchants.

source: དེའི་ཚེ་ཡང་ངས་འདི་རྣམས་འཇིགས་པ་ཆེན་པོ་ལས་བསྐྱབས་ནས། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དོ། །
en: At that time I rescued them from great danger and placed them in the four meditative states and five superknowledges,

source: ད་ལྟར་ཡང་ངས་འདི་རྣམས་འཇིགས་པ་ཆེན་པོ་ལས་བསྐྱབས་ནས། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་དོ། །
en: and now as well I have rescued them from great danger, and established them in the unsurpassed, supreme welfare of nirvāṇa.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་རྣམས་རབ་ཏུ་བྱུང་སྟེ།
en: “At that time they also went forth in the teaching of the totally and completely awakened Buddha Kāśyapa,

source: རབ་ཏུ་བྱུང་ནས་ཀྱང་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས།
en: and after they went forth, they practiced pure conduct all their lives.

source: དགེ་བའི་རྩ་བ་འདིས་ན་བདག་ཅག་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May we please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་ཤོག་ཅིག་ཅེས་བྱས་སོ། །
en: May we go forth in his doctrine, cast away all afflictive emotions, and manifest arhatship.’

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་ལྔ་བརྒྱ་པོར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི། ཚོང་པ་ལྔ་བརྒྱ་པོ་འདི་དག་ཉིད་ཡིན་ཏེ
en: The five hundred monks who went forth in the doctrine of the totally and completely awakened Kāśyapa then are none other than these five hundred merchants.

source: འདི་དག་དེར་རབ་ཏུ་བྱུང་ནས། ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ། འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: At that time they went forth, practiced pure conduct all their lives, and at the time of their deaths, they prayed,

source: དགེ་བའི་རྩ་བ་འདིས་བདག་ཅག་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May we please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: that they have pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: གྲོག་མ་གཉིས་ཞེས་བྱ་བ་ལ།
en: Ants: Two Stories

source: གྲོག་མ་དང་པོ་ནི།
en: The First “Ant” Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེར་གང་གི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽཎྜི་ནྱས་བདེན་པ་རྣམས་མཐོང་བ་དེའི་ཚེ། ལྷ་བརྒྱད་ཁྲིས་ཀྱང་བདེན་པ་མཐོང་བར་གྱུར་ཏོ། །
en: When the Blessed One was in Śrāvastī, Venerable All-Knowing Kauṇḍinya saw the truths, and when that happened eighty thousand gods saw the truths as well.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀཽཎྜི་ནྱ་ལ་སོགས་པ་ལྷ་བརྒྱད་ཁྲི་དམ་པའི་ཆོས་ཀྱི་བཅུད་ཀྱིས་ཚིམ་པར་མཛད་ནས། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་ལ་གཟིགས་ལགས།
en: “Lord, tell us why the Blessed One sated Kauṇḍinya and eighty thousand gods with a taste of the holy Dharma, establishing them in the unsurpassed, supreme welfare of nirvāṇa.”
